const areaSupportMap = {
  "ニューブリッジ": [],
  "黒田（自社）": [
    "埼玉県",
    "千葉県",
    "東京都",
    "神奈川県"
  ],
  "TEST": [],
  "冨永（自社）": [],
  "ブライト": [
    "埼玉県",
    "千葉県",
    "東京都",
    "神奈川県"
  ],
  "レンジャー": [],
  "小泉アンテナ": [
    "埼玉県",
    "千葉県",
    "東京都",
    "神奈川県"
  ],
  "77ホーム": [
    "埼玉県",
    "千葉県",
    "東京都",
    "神奈川県"
  ],
  "日本リノベーション": [
    "栃木県",
    "埼玉県",
    "東京都",
    "岐阜県",
    "愛知県",
    "三重県"
  ],
  "N.サービス": [],
  "首都圏ネット": [
    "埼玉県",
    "千葉県",
    "東京都",
    "神奈川県"
  ],
  "リブテック": [
    "埼玉県",
    "東京都",
    "神奈川県"
  ],
  "国本総合建設": [],
  "いしだでんき": [],
  "リレーション": [],
  "エスツー": [],
  "イトウデンキ": [],
  "瑞江冷熱工業": [
    "埼玉県",
    "千葉県",
    "東京都",
    "神奈川県"
  ],
  "テクノライン": [],
  "NONAMI": [],
  "アイコーポレーション": [],
  "ジェイグリッド": [
    "埼玉県",
    "千葉県",
    "東京都",
    "神奈川県"
  ],
  "松本総合サービス": [
    "埼玉県",
    "東京都"
  ],
  "デンテク": [],
  "麻生電設": [],
  "家電テクノ": [
    "埼玉県",
    "千葉県",
    "東京都",
    "神奈川県"
  ],
  "マイスタープラン": [
    "埼玉県",
    "千葉県",
    "東京都",
    "神奈川県"
  ],
  "ワンテイク": [],
  "橋場さん": [
    "北海道"
  ],
  "ミニマ": [
    "埼玉県",
    "千葉県",
    "東京都",
    "神奈川県"
  ],
  "ON": [
    "千葉県",
    "東京都"
  ],
  "JBテック": [
    "岩手県",
    "東京都",
    "神奈川県"
  ],
  "CRJ": [
    "神奈川県"
  ],
  "PMS": [],
  "工匠住建": [
    "神奈川県",
    "静岡県"
  ],
  "オオツキ": [
    "滋賀県",
    "京都府",
    "大阪府"
  ],
  "嵐": [
    "京都府",
    "大阪府"
  ],
  "高田空調": [
    "福岡県"
  ],
  "ユウキメンテナンス": [],
  "岩手便利屋センター": [
    "岩手県"
  ],
  "オール電気工房": [
    "京都府",
    "大阪府",
    "兵庫県",
    "奈良県"
  ],
  "vision": [],
  "日本住宅設備": [],
  "デンスケ": [],
  "POLY FLEX": [],
  "電湘設備": [],
  "F&H": [
    "茨城県",
    "栃木県",
    "群馬県",
    "埼玉県",
    "東京都",
    "神奈川県",
    "沖縄県"
  ],
  "スズデン": [],
  "イイネクルー": [
    "埼玉県",
    "千葉県",
    "東京都",
    "神奈川県",
    "山口県",
    "福岡県",
    "佐賀県"
  ],
  "守屋（自社）": [],
  "京葉建築": [
    "茨城県",
    "千葉県"
  ],
  "エレコム": [
    "兵庫県"
  ],
  "森正直堂": [
    "北海道"
  ],
  "岡村ハウス": [
    "東京都",
    "神奈川県"
  ],
  "": []
};

const categorySupportMap = {
  "ニューブリッジ": [
    "家庭用エアコン",
    "業務用エアコン"
  ],
  "黒田（自社）": [
    "照明",
    "スイッチ",
    "コンセント",
    "家庭用換気扇",
    "家庭用エアコン",
    "配線",
    "アンペア変更",
    "漏電",
    "ブレーカー",
    "分電盤",
    "洗濯機",
    "インターホン"
  ],
  "TEST": [],
  "冨永（自社）": [],
  "ブライト": [
    "照明",
    "スイッチ",
    "コンセント",
    "家庭用換気扇",
    "業務用換気扇",
    "家庭用エアコン",
    "業務用エアコン",
    "アンテナ",
    "LAN工事",
    "アンペア変更",
    "漏電",
    "ブレーカー",
    "分電盤",
    "洗濯機",
    "インターホン",
    "給湯器",
    "ブライトエアコン送りっぱなし8250",
    "その他(ブライト)3300",
    "ブライト電気送りっぱなし8250",
    "ブライト停止不可7150",
    "その他(ブライト)3300"
  ],
  "レンジャー": [],
  "小泉アンテナ": [
    "アンテナ"
  ],
  "77ホーム": [
    "家庭用エアコン",
    "業務用エアコン",
    "エアクリ",
    "洗濯機"
  ],
  "日本リノベーション": [
    "家庭用エアコン",
    "業務用エアコン"
  ],
  "N.サービス": [
    "家庭用エアコン"
  ],
  "首都圏ネット": [
    "照明",
    "スイッチ",
    "コンセント",
    "家庭用換気扇",
    "業務用換気扇",
    "配線",
    "LAN工事",
    "漏電",
    "ブレーカー",
    "分電盤",
    "インターホン"
  ],
  "リブテック": [
    "アンテナ"
  ],
  "国本総合建設": [
    "家庭用エアコン"
  ],
  "いしだでんき": [
    "照明",
    "スイッチ",
    "コンセント",
    "家庭用エアコン"
  ],
  "リレーション": [
    "家庭用エアコン",
    "業務用エアコン"
  ],
  "エスツー": [
    "照明",
    "スイッチ",
    "コンセント",
    "家庭用換気扇",
    "家庭用エアコン",
    "業務用エアコン",
    "アンペア変更",
    "漏電",
    "ブレーカー",
    "分電盤",
    "インターホン"
  ],
  "イトウデンキ": [
    "家庭用エアコン",
    "給湯器"
  ],
  "瑞江冷熱工業": [
    "業務用エアコン"
  ],
  "テクノライン": [],
  "NONAMI": [
    "家庭用エアコン",
    "業務用エアコン"
  ],
  "アイコーポレーション": [
    "エアクリ"
  ],
  "ジェイグリッド": [
    "照明",
    "スイッチ",
    "コンセント",
    "家庭用換気扇",
    "業務用換気扇",
    "家庭用エアコン",
    "配線",
    "LAN工事",
    "アンペア変更",
    "漏電",
    "ブレーカー",
    "分電盤",
    "洗濯機",
    "インターホン",
    "給湯器",
    "シャッター＆自動ドア"
  ],
  "松本総合サービス": [
    "家庭用エアコン",
    "業務用エアコン"
  ],
  "デンテク": [],
  "麻生電設": [
    "アンテナ"
  ],
  "家電テクノ": [
    "家庭用エアコン",
    "配線",
    "洗濯機"
  ],
  "マイスタープラン": [
    "家庭用エアコン",
    "業務用エアコン"
  ],
  "ワンテイク": [],
  "橋場さん": [
    "アンテナ"
  ],
  "ミニマ": [
    "アンテナ"
  ],
  "ON": [
    "照明",
    "スイッチ",
    "コンセント",
    "家庭用換気扇",
    "業務用換気扇",
    "家庭用エアコン",
    "業務用エアコン",
    "アンテナ",
    "配線",
    "LAN工事",
    "アンペア変更",
    "漏電",
    "ブレーカー",
    "分電盤",
    "インターホン"
  ],
  "JBテック": [
    "家庭用エアコン"
  ],
  "CRJ": [
    "家庭用エアコン",
    "業務用エアコン",
    "エアクリ"
  ],
  "PMS": [
    "アンテナ"
  ],
  "工匠住建": [],
  "オオツキ": [
    "家庭用エアコン",
    "業務用エアコン",
    "アンテナ"
  ],
  "嵐": [
    "業務用エアコン"
  ],
  "高田空調": [
    "家庭用エアコン"
  ],
  "ユウキメンテナンス": [],
  "岩手便利屋センター": [
    "家庭用エアコン"
  ],
  "オール電気工房": [
    "照明",
    "スイッチ",
    "コンセント",
    "家庭用換気扇",
    "配線",
    "アンペア変更",
    "漏電",
    "ブレーカー",
    "分電盤",
    "インターホン"
  ],
  "vision": [],
  "日本住宅設備": [],
  "デンスケ": [],
  "POLY FLEX": [],
  "電湘設備": [],
  "F&H": [
    "家庭用エアコン",
    "業務用エアコン",
    "エアクリ",
    "給湯器"
  ],
  "スズデン": [],
  "イイネクルー": [
    "造園",
    "害虫"
  ],
  "守屋（自社）": [],
  "京葉建築": [
    "照明",
    "スイッチ",
    "コンセント",
    "アンテナ",
    "配線",
    "漏電",
    "ブレーカー",
    "分電盤",
    "給湯器"
  ],
  "エレコム": [],
  "森正直堂": [
    "照明",
    "家庭用エアコン",
    "業務用エアコン"
  ],
  "岡村ハウス": [
    "造園",
    "害虫"
  ],
  "": []
};

const engineerLimitMap = {
  "ニューブリッジ": "停止",
  "黒田（自社）": 100,
  "TEST": "停止",
  "冨永（自社）": "停止",
  "ブライト": 100,
  "レンジャー": "停止",
  "小泉アンテナ": "停止",
  "77ホーム": 100,
  "日本リノベーション": 100,
  "N.サービス": "停止",
  "首都圏ネット": 100,
  "リブテック": 100,
  "国本総合建設": "停止",
  "いしだでんき": "停止",
  "リレーション": "停止",
  "エスツー": "停止",
  "イトウデンキ": "停止",
  "瑞江冷熱工業": 100,
  "テクノライン": "停止",
  "NONAMI": "停止",
  "アイコーポレーション": "停止",
  "ジェイグリッド": 100,
  "松本総合サービス": 100,
  "デンテク": "停止",
  "麻生電設": "停止",
  "家電テクノ": 100,
  "マイスタープラン": 100,
  "ワンテイク": "停止",
  "橋場さん": "停止",
  "ミニマ": 100,
  "ON": 100,
  "JBテック": "停止",
  "CRJ": 100,
  "PMS": "停止",
  "工匠住建": 100,
  "オオツキ": "停止",
  "嵐": 100,
  "高田空調": 100,
  "ユウキメンテナンス": "停止",
  "岩手便利屋センター": "停止",
  "オール電気工房": "停止",
  "vision": "停止",
  "日本住宅設備": "停止",
  "デンスケ": "停止",
  "POLY FLEX": "停止",
  "電湘設備": 100,
  "F&H": 100,
  "スズデン": "停止",
  "イイネクルー": "停止",
  "守屋（自社）": "停止",
  "京葉建築": 100,
  "エレコム": 100,
  "森正直堂": 100,
  "岡村ハウス": "停止",
  "": 0
};