const areaSupportMap = {
  "ニューブリッジ": [
    "宮城県",
    "福島県",
    "茨城県",
    "栃木県",
    "群馬県",
    "埼玉県",
    "千葉県",
    "東京都",
    "神奈川県",
    "新潟県",
    "富山県",
    "石川県",
    "福井県",
    "長野県",
    "岐阜県",
    "静岡県",
    "愛知県",
    "三重県",
    "滋賀県",
    "大阪府",
    "兵庫県",
    "奈良県",
    "岡山県",
    "広島県",
    "徳島県",
    "香川県",
    "愛媛県",
    "高知県",
    "福岡県",
    "佐賀県",
    "長崎県",
    "熊本県",
    "大分県",
    "宮崎県",
    "鹿児島県"
  ],
  "黒田（自社）": [
    "埼玉県",
    "千葉県",
    "東京都",
    "神奈川県",
    "静岡県"
  ],
  "TEST": [
    "北海道",
    "青森県",
    "岩手県",
    "宮城県",
    "秋田県",
    "山形県",
    "福島県",
    "茨城県",
    "栃木県",
    "群馬県",
    "埼玉県",
    "千葉県",
    "東京都",
    "神奈川県",
    "新潟県",
    "富山県",
    "石川県",
    "福井県",
    "山梨県",
    "長野県",
    "岐阜県",
    "静岡県",
    "愛知県",
    "三重県",
    "滋賀県",
    "京都府",
    "大阪府",
    "兵庫県",
    "奈良県",
    "和歌山県",
    "鳥取県",
    "島根県",
    "岡山県",
    "広島県",
    "山口県",
    "徳島県",
    "香川県",
    "愛媛県",
    "高知県",
    "福岡県",
    "佐賀県",
    "長崎県",
    "熊本県",
    "大分県",
    "宮崎県",
    "鹿児島県",
    "沖縄県"
  ],
  "冨永（自社）": [
    "埼玉県",
    "千葉県",
    "東京都",
    "神奈川県"
  ],
  "ブライト": [
    "千葉県",
    "東京都",
    "神奈川県",
    "静岡県",
    "愛知県",
    "京都府",
    "大阪府",
    "奈良県"
  ],
  "レンジャー": [],
  "小泉アンテナ": [
    "埼玉県",
    "千葉県",
    "東京都",
    "神奈川県"
  ],
  "77ホーム": [
    "埼玉県",
    "千葉県",
    "東京都",
    "神奈川県"
  ],
  "日本リノベーション": [
    "埼玉県",
    "東京都",
    "新潟県",
    "富山県",
    "石川県",
    "京都府",
    "大阪府",
    "熊本県"
  ],
  "N.サービス": [
    "岐阜県",
    "愛知県"
  ],
  "首都圏ネット": [
    "埼玉県",
    "千葉県",
    "東京都",
    "神奈川県"
  ],
  "リブテック": [
    "埼玉県",
    "東京都",
    "神奈川県"
  ],
  "国本総合建設": [],
  "いしだでんき": [
    "兵庫県"
  ],
  "リレーション": [
    "大阪府",
    "兵庫県"
  ],
  "エスツー": [
    "岐阜県",
    "愛知県",
    "三重県"
  ],
  "イトウデンキ": [
    "京都府",
    "大阪府"
  ],
  "瑞江冷熱工業": [
    "埼玉県",
    "千葉県",
    "東京都",
    "神奈川県"
  ],
  "テクノライン": [],
  "NONAMI": [
    "千葉県",
    "東京都",
    "神奈川県"
  ],
  "アイコーポレーション": [
    "埼玉県",
    "千葉県",
    "東京都",
    "神奈川県"
  ],
  "ジェイグリッド": [
    "埼玉県",
    "千葉県",
    "東京都",
    "神奈川県"
  ],
  "松本総合サービス": [
    "埼玉県",
    "東京都"
  ],
  "デンテク": [],
  "麻生電設": [],
  "家電テクノ": [
    "埼玉県",
    "千葉県",
    "東京都",
    "神奈川県"
  ],
  "マイスタープラン": [
    "埼玉県",
    "千葉県",
    "東京都",
    "神奈川県"
  ],
  "ワンテイク": [
    "京都府",
    "大阪府",
    "兵庫県",
    "沖縄県"
  ],
  "橋場さん": [
    "北海道"
  ],
  "ミニマ": [
    "埼玉県",
    "千葉県",
    "東京都",
    "神奈川県"
  ],
  "ON": [
    "千葉県",
    "東京都"
  ],
  "JBテック": [
    "東京都",
    "神奈川県"
  ],
  "CRJ": [
    "神奈川県"
  ],
  "PMS": [],
  "工匠住建": [
    "滋賀県",
    "京都府"
  ],
  "オオツキ": [
    "静岡県",
    "愛知県"
  ],
  "嵐": [],
  "高田空調": []
};

const categorySupportMap = {
  "ニューブリッジ": [
    "照明",
    "スイッチ",
    "コンセント",
    "家庭用エアコン",
    "漏電",
    "ブレーカー",
    "分電盤",
    "インターホン"
  ],
  "黒田（自社）": [
    "照明",
    "スイッチ",
    "コンセント",
    "家庭用換気扇",
    "家庭用エアコン",
    "配線",
    "アンペア変更",
    "漏電",
    "ブレーカー",
    "分電盤",
    "洗濯機",
    "インターホン"
  ],
  "TEST": [
    "照明",
    "スイッチ",
    "コンセント",
    "家庭用換気扇",
    "業務用換気扇",
    "家庭用エアコン",
    "業務用エアコン",
    "エアクリ",
    "ハウクリ",
    "アンテナ",
    "配線",
    "LAN工事",
    "アンペア変更",
    "漏電",
    "ブレーカー",
    "分電盤",
    "洗濯機",
    "インターホン",
    "給湯器",
    "シャッター＆自動ドア",
    "6600案件（忘年会）",
    "その他(ブライト)3300"
  ],
  "冨永（自社）": [
    "照明",
    "スイッチ",
    "コンセント",
    "家庭用換気扇",
    "家庭用エアコン",
    "アンテナ",
    "配線",
    "LAN工事",
    "アンペア変更",
    "漏電",
    "ブレーカー",
    "分電盤",
    "インターホン"
  ],
  "ブライト": [
    "照明",
    "スイッチ",
    "コンセント",
    "家庭用換気扇",
    "業務用換気扇",
    "家庭用エアコン",
    "業務用エアコン",
    "アンテナ",
    "LAN工事",
    "アンペア変更",
    "漏電",
    "ブレーカー",
    "分電盤",
    "洗濯機",
    "インターホン",
    "給湯器"
  ],
  "レンジャー": [],
  "小泉アンテナ": [
    "アンテナ"
  ],
  "77ホーム": [
    "家庭用エアコン",
    "業務用エアコン",
    "エアクリ"
  ],
  "日本リノベーション": [
    "家庭用エアコン",
    "業務用エアコン"
  ],
  "N.サービス": [
    "家庭用エアコン"
  ],
  "首都圏ネット": [
    "照明",
    "スイッチ",
    "コンセント",
    "家庭用換気扇",
    "業務用換気扇",
    "配線",
    "LAN工事",
    "漏電",
    "ブレーカー",
    "分電盤",
    "インターホン"
  ],
  "リブテック": [
    "アンテナ"
  ],
  "国本総合建設": [
    "家庭用エアコン"
  ],
  "いしだでんき": [
    "照明",
    "スイッチ",
    "コンセント",
    "家庭用エアコン"
  ],
  "リレーション": [
    "家庭用エアコン",
    "業務用エアコン"
  ],
  "エスツー": [
    "照明",
    "スイッチ",
    "コンセント",
    "家庭用換気扇",
    "家庭用エアコン",
    "業務用エアコン",
    "アンペア変更",
    "漏電",
    "ブレーカー",
    "分電盤",
    "インターホン"
  ],
  "イトウデンキ": [
    "家庭用エアコン",
    "給湯器"
  ],
  "瑞江冷熱工業": [
    "業務用エアコン"
  ],
  "テクノライン": [],
  "NONAMI": [
    "家庭用エアコン",
    "業務用エアコン"
  ],
  "アイコーポレーション": [
    "エアクリ"
  ],
  "ジェイグリッド": [
    "照明",
    "スイッチ",
    "コンセント",
    "家庭用換気扇",
    "業務用換気扇",
    "家庭用エアコン",
    "配線",
    "LAN工事",
    "アンペア変更",
    "漏電",
    "ブレーカー",
    "分電盤",
    "洗濯機",
    "インターホン",
    "給湯器",
    "シャッター＆自動ドア"
  ],
  "松本総合サービス": [
    "家庭用エアコン",
    "業務用エアコン"
  ],
  "デンテク": [],
  "麻生電設": [
    "アンテナ"
  ],
  "家電テクノ": [
    "家庭用エアコン",
    "配線",
    "洗濯機"
  ],
  "マイスタープラン": [
    "家庭用エアコン",
    "業務用エアコン"
  ],
  "ワンテイク": [
    "家庭用エアコン"
  ],
  "橋場さん": [
    "アンテナ"
  ],
  "ミニマ": [
    "アンテナ"
  ],
  "ON": [
    "照明",
    "スイッチ",
    "コンセント",
    "家庭用換気扇",
    "業務用換気扇",
    "家庭用エアコン",
    "業務用エアコン",
    "アンテナ",
    "配線",
    "LAN工事",
    "アンペア変更",
    "漏電",
    "ブレーカー",
    "分電盤",
    "インターホン"
  ],
  "JBテック": [
    "家庭用エアコン"
  ],
  "CRJ": [
    "家庭用エアコン",
    "業務用エアコン",
    "エアクリ"
  ],
  "PMS": [
    "アンテナ"
  ],
  "工匠住建": [],
  "オオツキ": [
    "家庭用エアコン",
    "業務用エアコン",
    "アンテナ"
  ],
  "嵐": [],
  "高田空調": []
};

const engineerLimitMap = {
  "ニューブリッジ": 100,
  "黒田（自社）": 100,
  "TEST": 200,
  "冨永（自社）": 100,
  "ブライト": 100,
  "レンジャー": 100,
  "小泉アンテナ": 100,
  "77ホーム": 100,
  "日本リノベーション": 100,
  "N.サービス": 100,
  "首都圏ネット": 100,
  "リブテック": 100,
  "国本総合建設": 100,
  "いしだでんき": 100,
  "リレーション": 100,
  "エスツー": 100,
  "イトウデンキ": 100,
  "瑞江冷熱工業": 100,
  "テクノライン": 100,
  "NONAMI": 100,
  "アイコーポレーション": 100,
  "ジェイグリッド": 100,
  "松本総合サービス": 100,
  "デンテク": 100,
  "麻生電設": 100,
  "家電テクノ": 100,
  "マイスタープラン": 100,
  "ワンテイク": 100,
  "橋場さん": 100,
  "ミニマ": 100,
  "ON": 100,
  "JBテック": 100,
  "CRJ": 100,
  "PMS": 100,
  "工匠住建": 100,
  "オオツキ": 100,
  "嵐": 100,
  "高田空調": 100
};